tap "dart-lang/dart"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"

# Only on macOS
if OS.mac?
  tap "buo/cask-upgrade"
  tap "grishka/grishka"
  tap "leoafarias/fvm"
  tap "homebrew/cask"
  tap "homebrew/cask-fonts"
  tap "homebrew/cask-versions"
  tap "sanemat/font"
  brew "awscli"
  brew "blueutil"
  brew "ios-deploy"
  brew "iproute2mac"
  brew "ffmpeg"
  brew "libiconv"
  brew "cocoapods"
  brew "mas"
  brew "openssl@3"
  brew "t-rec"
end

brew "jpeg"
brew "libpng"
brew "openssl@3"
brew "autoconf"
brew "bat"
brew "bitwarden-cli"
brew "bundletool"
brew "bzip2"
brew "pkg-config"
brew "cmatrix"
brew "curl"
brew "composer"
brew "coreutils"
brew "curl"
brew "eza"
brew "fd"
brew "icu4c"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "httpd", restart_service: true
brew "hub"
brew "oniguruma"
brew "jq"
brew "libedit"
brew "libxml2"
brew "libzip"
brew "mise"
brew "peco"
brew "poetry"
brew "procs"
brew "python-tk@3.11"
brew "ripgrep"
brew "rye"
brew "scrcpy"
brew "screenfetch"
brew "sl"
brew "starship"
brew "t-rec"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "leoafarias/fvm/fvm"

cask "adobe-acrobat-reader"
cask "android-platform-tools"
cask "android-studio"
cask "audacity"
cask "bettertouchtool"
cask "calibre"
cask "cheatsheet"
cask "cleanshot"
cask "devtoys"
cask "discord"
cask "docker"
cask "dropbox"
cask "duet"
cask "figma"
cask "firefox"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "geekbench"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "google-drive-file-stream"
cask "google-japanese-ime"
cask "imobie-m1-app-checker"
cask "iterm2"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "licecap"
cask "microsoft-remote-desktop"
cask "monitorcontrol"
cask "multipass"
cask "neardrop"
cask "notion"
cask "notion-calendar"
cask "parallels"
cask "postman"
cask "raycast"
cask "slack"
cask "spotify"
cask "steam"
cask "tableplus"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "vivaldi"
cask "vlc"
cask "zoom"

# Only on macOS
if OS.mac?
  mas "Bitwarden", id: 1352778147
  mas "DaisyDisk", id: 411643860
  mas "Developer", id: 640199958
  mas "GarageBand", id: 682658836
  mas "Hidden Bar", id: 1452453066
  mas "iMovie", id: 408981434
  mas "Keynote", id: 409183694
  mas "Kindle", id: 302584613
  mas "LINE", id: 539883307
  mas "Microsoft Remote Desktop", id: 1295203466
  mas "Notion Web Clipper", id: 1559269364
  mas "Numbers", id: 409203825
  mas "Pages", id: 409201541
  mas "PopClip", id: 445189367
  mas "Reeder", id: 1529448980
  mas "RunCat", id: 1429033973
  mas "Spark Desktop", id: 6445813049
  mas "TestFlight", id: 899247664
  mas "Xcode", id: 497799835
  mas "Yoink", id: 457622435
end
